STMicroelectronics/STM32CubeWBA/Drivers/BSP/STM32WBA55G-DK1/stm32wba55g_discovery.c
      if ((status == HAL_OK) && (MXInit->ContinuousConvMode == ENABLE))
      {
        ADC_AnalogWDGConfTypeDef AnalogWDGConfig;
        AnalogWDGConfig.WatchdogNumber = ADC_ANALOGWATCHDOG_1;
        AnalogWDGConfig.WatchdogMode   = ADC_ANALOGWATCHDOG_SINGLE_REG;
        AnalogWDGConfig.Channel        = ADC_CHANNEL_8;
        AnalogWDGConfig.ITMode         = ENABLE;
        AnalogWDGConfig.HighThreshold  = 0xFFFU;
        AnalogWDGConfig.LowThreshold   = 0xE1FU;
        status = HAL_ADC_AnalogWDGConfig(hadc, &AnalogWDGConfig);
      }
    }
  }

  return status;
}

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register default BSP JOY msp callbacks.
  * @param  JOY_TypeDef Joystick Instance.
  * @retval BSP status.
  */
int32_t BSP_JOY_RegisterDefaultMspCallbacks(JOY_TypeDef JOY)
{
  int32_t status = BSP_ERROR_NONE;

  /* Register MspInit/MspDeInit callbacks */
  if (HAL_ADC_RegisterCallback(&hjoy_adc[JOY], HAL_ADC_MSPINIT_CB_ID, ADC_MspInit) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else if (HAL_ADC_RegisterCallback(&hjoy_adc[JOY], HAL_ADC_MSPDEINIT_CB_ID, ADC_MspDeInit) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    IsJoyMspCbValid[JOY] = 1U;
  }

  /* Return BSP status */
  return status;
}

/**
  * @brief  Register BSP JOY msp callbacks.
  * @param  JOY_TypeDef Joystick Instance.
  * @retval BSP status.
  */
int32_t BSP_JOY_RegisterMspCallbacks(JOY_TypeDef JOY, BSP_JOY_Cb_t *CallBacks)
{
  int32_t status = BSP_ERROR_NONE;

  if (CallBacks == NULL)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Register MspInit/MspDeInit callbacks */
    if (HAL_ADC_RegisterCallback(&hjoy_adc[JOY], HAL_ADC_MSPINIT_CB_ID, CallBacks->pMspInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_ADC_RegisterCallback(&hjoy_adc[JOY], HAL_ADC_MSPDEINIT_CB_ID, CallBacks->pMspDeInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsJoyMspCbValid[JOY] = 1U;
    }
  }
  /* Return BSP status */
  return status;
}
#endif /* (USE_HAL_ADC_REGISTER_CALLBACKS == 1) */

/**
  * @brief  BSP Joystick Callback.
  * @param  JOY Joystick to be de-init.
  *   This parameter can be JOY1
  * @param  JoyPin Specifies joystick pin.
  *   This parameter can be one of following parameters:
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  * @retval None.
  */
__weak void BSP_JOY_Callback(JOY_TypeDef JOY, JOYPin_TypeDef JoyPin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(JOY);
  UNUSED(JoyPin);

  /* This function should be implemented by the user application.
     It is called into this driver when an event on JoyPin is triggered. */
}

/**
  * @brief  BSP JOY interrupt handler.
  * @param  JOY Joystick.
  *   This parameter can be JOY1
  * @param  JoyPin Specifies joystick pin.
  *   This parameter can be one of following parameters:
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  * @retval None.
  */
void BSP_JOY_IRQHandler(JOY_TypeDef JOY, JOYPin_TypeDef JoyPin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(JoyPin);

  HAL_ADC_IRQHandler(&hjoy_adc[JOY]);
}

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 0)
/**
  * @brief  Analog watchdog callback in non blocking mode.
  * @param  hadc: ADC handle
  * @retval None
  */
void HAL_ADC_LevelOutOfWindowCallback(ADC_HandleTypeDef* hadc)
{
  __IO uint16_t  keyconvertedvalue;
  __IO uint32_t  tickvalue = HAL_GetTick();
  uint32_t       joy_tick_debounce = joy_tick + BSP_JOY_DEBOUNCE_DELAY;

  /* Check if ADC interrupt is called twice inside the debounce delay */
  if (joy_tick_debounce < tickvalue)
  {
    /* Retrieve ADC conversion data */
    /* Note: data scale corresponds to ADC resolution */
    keyconvertedvalue = HAL_ADC_GetValue(hadc);

    if ((keyconvertedvalue >= 2800U) && (keyconvertedvalue < 3600U))
    {
      if (CurrentJoyPins[JOY1] & JOY_DOWN)
      {
        BSP_JOY_Callback(JOY1, JOY_DOWN);
      }
    }
    else if ((keyconvertedvalue >= 2000U) && (keyconvertedvalue < 2800U))
    {
      if (CurrentJoyPins[JOY1] & JOY_RIGHT)
      {
        BSP_JOY_Callback(JOY1, JOY_RIGHT);
      }
    }
    else if ((keyconvertedvalue >= 1200U) && (keyconvertedvalue < 2000U))
    {
      if (CurrentJoyPins[JOY1] & JOY_LEFT)
      {
        BSP_JOY_Callback(JOY1, JOY_LEFT);
      }
    }
    else if ((keyconvertedvalue >= 400U) && (keyconvertedvalue < 1200U))
    {
      if (CurrentJoyPins[JOY1] & JOY_UP)
      {
        BSP_JOY_Callback(JOY1, JOY_UP);
      }
    }
    else if (keyconvertedvalue < 400U)
    {
      if (CurrentJoyPins[JOY1] & JOY_SEL)
      {
        BSP_JOY_Callback(JOY1, JOY_SEL);
      }
    }
    else
    {
      /* Nothing to do */
    }
    /* Save Joystick interrupt tick value */
    joy_tick = HAL_GetTick();
  }
}
#endif /* (USE_HAL_ADC_REGISTER_CALLBACKS == 0) */
/**
  * @}
  */

/** @defgroup STM32WBA55G_DK1_LOW_LEVEL_Private_Functions LOW LEVEL Private Functions
  * @{
  */
#if (USE_BSP_COM_FEATURE == 1)
/**
  * @brief  Initialize UART MSP.
  * @param  huart UART handle.
  * @retval None.
  */
static void UART_MspInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef GPIO_Init;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(huart);

  /* Enable COM and GPIO clocks */
  COM1_TX_GPIO_CLK_ENABLE();
  COM1_RX_GPIO_CLK_ENABLE();
  COM1_CLK_ENABLE();

  /* Configure COM Tx as alternate function */
  GPIO_Init.Pin       = COM1_TX_PIN;
  GPIO_Init.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init.Pull      = GPIO_PULLUP;
  GPIO_Init.Alternate = COM1_TX_AF;
  HAL_GPIO_Init(COM1_TX_GPIO_PORT, &GPIO_Init);

  /* Configure COM Rx as alternate function */
  GPIO_Init.Pin       = COM1_RX_PIN;
  GPIO_Init.Alternate = COM1_RX_AF;
  HAL_GPIO_Init(COM1_RX_GPIO_PORT, &GPIO_Init);
}

/**
  * @brief  Deinitialize UART MSP.
  * @param  huart UART handle.
  * @retval None.
  */
static void UART_MspDeInit(UART_HandleTypeDef *huart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(huart);

