STMicroelectronics/STM32CubeWBA/Drivers/BSP/STM32WBA55G-DK1/stm32wba55g_discovery.c
  /* Disable GPIOs and COM clock */
  HAL_GPIO_DeInit(COM1_TX_GPIO_PORT, COM1_TX_PIN);
  HAL_GPIO_DeInit(COM1_RX_GPIO_PORT, COM1_RX_PIN);
  COM1_CLK_DISABLE();
}
#endif /* (USE_BSP_COM_FEATURE == 1) */

/**
  * @brief  Initialize ADC MSP.
  * @param  hadc ADC handle.
  * @retval None.
  */
static void ADC_MspInit(ADC_HandleTypeDef *hadc)
{
  GPIO_InitTypeDef         GPIO_Init;
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hadc);

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
  PeriphClkInit.AdcClockSelection = RCC_ADCCLKSOURCE_HCLK;
  (void) HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);

  /* Enable ADC clock */
  JOY1_CLK_ENABLE();

  /* Enable GPIO clock */
  JOY1_CHANNEL_GPIO_CLK_ENABLE();

  /* Configure the selected ADC Channel as analog input */
  GPIO_Init.Pin       = JOY1_CHANNEL_GPIO_PIN;
  GPIO_Init.Mode      = GPIO_MODE_ANALOG;
  GPIO_Init.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init.Pull      = GPIO_NOPULL;
  HAL_GPIO_Init(JOY1_CHANNEL_GPIO_PORT, &GPIO_Init);

  /* ADC4 interrupt Init */
  HAL_NVIC_SetPriority(ADC4_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(ADC4_IRQn);
}

/**
  * @brief  Deinitialize ADC MSP.
  * @param  hadc ADC handle.
  * @retval None.
  */
static void ADC_MspDeInit(ADC_HandleTypeDef *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hadc);

  /* Disable GPIOs and ADC clock */
  HAL_GPIO_DeInit(JOY1_CHANNEL_GPIO_PORT, JOY1_CHANNEL_GPIO_PIN);
  JOY1_CLK_DISABLE();
}

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Analog watchdog 1 callback in non-blocking mode.
  * @param hadc ADC handle
  * @retval None
  */
static void ADC_LevelOutOfWindowCallback(ADC_HandleTypeDef *hadc)
{
 __IO uint16_t  keyconvertedvalue;
  __IO uint32_t  tickvalue = HAL_GetTick();
  uint32_t       joy_tick_debounce = joy_tick + BSP_JOY_DEBOUNCE_DELAY;

  /* Check if ADC interrupt is called twice inside the debounce delay */
  if (joy_tick_debounce < tickvalue)
  {
    /* Retrieve ADC conversion data */
    /* Note: data scale corresponds to ADC resolution */
    keyconvertedvalue = HAL_ADC_GetValue(hadc);

    if ((keyconvertedvalue >= 2800U) && (keyconvertedvalue < 3600U))
    {
      if (CurrentJoyPins[JOY1] & JOY_DOWN)
      {
        BSP_JOY_Callback(JOY1, JOY_DOWN);
      }
    }
    else if ((keyconvertedvalue >= 2000U) && (keyconvertedvalue < 2800U))
    {
      if (CurrentJoyPins[JOY1] & JOY_RIGHT)
      {
        BSP_JOY_Callback(JOY1, JOY_RIGHT);
      }
    }
    else if ((keyconvertedvalue >= 1200U) && (keyconvertedvalue < 2000U))
    {
      if (CurrentJoyPins[JOY1] & JOY_LEFT)
      {
        BSP_JOY_Callback(JOY1, JOY_LEFT);
      }
    }
    else if ((keyconvertedvalue >= 400U) && (keyconvertedvalue < 1200U))
    {
      if (CurrentJoyPins[JOY1] & JOY_UP)
      {
        BSP_JOY_Callback(JOY1, JOY_UP);
      }
    }
    else if (keyconvertedvalue < 400U)
    {
      if (CurrentJoyPins[JOY1] & JOY_SEL)
      {
        BSP_JOY_Callback(JOY1, JOY_SEL);
      }
    }
    else
    {
      /* Nothing to do */
    }
    /* Save Joystick interrupt tick value */
    joy_tick = HAL_GetTick();
  }
}
#endif /* (USE_ADC_SAI_REGISTER_CALLBACKS == 1) */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
